import React from 'react';
import PropTypes from 'prop-types';

import { Panel, PanelHeader, PanelHeaderBack } from '@vkontakte/vkui';

import novomych from '../img/novomych.jpg';
import './Novomychenik.css';
/*<script> function foo(foo) {alert(document.getElementById("primer").value)} </script>
<input id="primer" value="Здесь данные в value"/> 

		<button onClick="foo()">Жми!</button>*/
const Novomychenik = props => (
	<Panel id={props.id}>
		<PanelHeader
			before={<PanelHeaderBack onClick={props.go} data-to="home"/>}
		>
			Novomychenik
		</PanelHeader>
		<img className="Novomychenik" src={novomych} alt="For Christ, the victims"/>
		

		
		<table border="1" width="100%">
   			<caption><b>РАСПИСАНИЕ</b><br/><i>Богослужений в Троицком храме г. Старая Купавна</i></caption>
	    	<tbody>

			   <tr><td align="center"><b>27<br/>февраля<br/>понедельник</b></td><td><b>07:00   Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><br/><b>17:00   Вечерня. Лития. <br/>Великое повечерие с чтением Великого<br/>канона Прп. Андрея Критского.</b></td><td align="center"><b>Равноап. Кирилла<br/>Словенского<br/></b>(ок.470)</td></tr>
			   <tr><td align="center"><b>28<br/>февраля<br/>вторник</b></td><td><b>07:00   Утреня, часы, изобразительны.<br/></b>Литургии не положено.<b><br/><br/>17:00   Вечерня. Лития.<br/>Великое повечерие с чтением Великого<br/>канона Прп. Андрея Критского.</b></td><td align="center"><b>Прп. Пафнутия,<br/>затворника<br/>Печерского, в дальних<br/>пещерах<br/></b>(XIII)</td></tr>
			   <tr><td align="center"><b>1<br/>марта<br/>среда</b></td><td><b>07:00   Утреня, часы, изобразительны.<br/>17:00   Вечерня с Литургией <br/>Преждеосвященных Даров.<br/>Великое повечерие с чтением Великого<br/>канона Прп. Андрея Критского.</b></td><td align="center"><b>Мчч. Памфила и иже<br/>с ним<br/></b>(307-309)</td></tr>
			   <tr><td align="center"><b>2<br/>марта<br/>четверг</b></td><td><b>07:00   Утреня, часы, изобразительны.<br/></b>Литургии не положено.<b>17:00   Вечерня. Лития.<br/>Великое повечерие с чтением Великого<br/>канона Прп. Андрея Критского.</b></td><td align="center"><b>Сщмч.Ермогена<br/>патриарха<br/>Московского и всея<br/>России, чудотворца<br/></b>(1612)</td></tr>
			   <tr><td align="center"><b>3<br/>марта<br/>пятница</b></td><td><b>07:00   Часы, Изобразительны, Вечерня<br/>с Литургией Преждеосвященных Даров.<br/></b><i>Освящение Колива.<br/></i><b>16:00 Утреня </b></td><td align="center"><b>Свт.Льва.папы<br/>Римского<br/></b>(461)</td></tr>
			   <tr><td align="center"><b>4<br/>марта<br/>суббота</b></td><td><b>08:00   Исповедь. Часы. Божественная<br/>Литургия.<br/>16:00   Всенощное бдение.</b></td><td align="center"><b>Вмч. Феодора<br/>Тирона<br/></b>(ок.306)</td></tr>
			   <tr><td align="center"><b>5<br/>марта<br/>воскресенье</b></td><td><b>08:00   Исповедь.<br/>08:30   Часы. Божественная<br/>Литургия. Молебен Торжеству<br/>Православия.</b></td><td align="center"><b>Неделя 1-ая<br/>Великого поста<br/>Торжество<br/>Православия</b></td></tr>

			   <tr><td align="center"><b>6<br/>марта<br/>понедельник</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><b>16:00  Вечерня. Лития.</b></td><td align="center"><b>Прп. Тимофея в<br/>Символех<br/></b>(795)</td></tr>
			   <tr><td align="center"><b>7<br/>марта<br/>вторник</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><b>16:00  Вечерня. Лития.</b></td><td align="center"><b>Обретение мощей<br/>мучеников, иже во<br/>Евгеннн<br/></b>(395-423)</td></tr>
			   <tr><td align="center"><b>8<br/>марта<br/>среда</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><b>17:00 Вечерня с Литургией<br/>Преждеосвященных Даров</b></td><td align="center"><b>Сщмч. Поликарпа, еп.<br/>Смирнского<br/></b>(167)</td></tr>
			   <tr><td align="center"><b>9<br/>марта<br/>четверг</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><b>17:00 Вечерня с Литургией<br/>Преждеосвященных Даров</b></td><td align="center"><b>Первое и второе<br/>обретение главы<br/>Иоанна Предтечи<br/></b>(lV;452)</td></tr>
			   <tr><td align="center"><b>10<br/>марта<br/>пятница</b></td><td><b>08:00 Часы, изобразительны,<br/>           Вечерня с Литургией<br/>Преждеосвященных Даров<br/><br/>16:00 Утреня<br/>(ПАРАСТАС-поминовение усопших)</b></td><td align="center"><b>Свт. Тарасия,<br/>архиеп.<br/>Константинопольс<br/>кого<br/></b>(806)</td></tr>
			   <tr><td align="center"><b>11<br/>марта<br/>суббота</b></td><td><b>08:00   Часы. Божественная Литургия.<br/>Панихида<br/>16:00   Всенощное бдение.<br/><br/><i>08:00 Исповедь. Часы. Божественная<br/>Литургия в больничном храме свт.<br/>ЛУКИ (ВОЙНО-ЯСЕНЕЦКОГО)</i></b></td><td align="center"><b>Поминовение<br/>усопших.</b></td></tr>
			   <tr><td align="center"><b>12<br/>марта<br/>воскресенье</b></td><td><b>08:00   Исповедь.<br/>08:30   Часы. Божественная<br/>Литургия.<br/>16:00   Соборование</b></td><td align="center"><b>Неделя 2-я<br/>Великого поста.<br/>Свт. Григория<br/>Паламы.</b></td></tr>

			   <tr><td align="center"><b>13<br/>марта<br/>понедельник</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><b>16:00 Вечерня. Лития</b></td><td align="center"><b>Прп. Василия<br/>Исповедника<br/></b>(750)</td></tr>
			   <tr><td align="center"><b>14<br/>марта<br/>вторник</b></td><td><b>08:00 Утреня, часы. Изобразительны.<br/>16:00 Вечерня. Лития</b></td><td align="center"><b>Прмц. Евдокии<br/></b>(160-170)</td></tr>
			   <tr><td align="center"><b>15<br/>марта<br/>среда</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/>17:00 Вечерня с Литургией<br/>Преждеосвященных Даров</b></td><td align="center"><b>Иконы Божией<br/>Матери , именуемой<br/>«Державная»</b></td></tr>
			   <tr><td align="center"><b>16<br/>марта<br/>четверг</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><b>16:00 Вечерня. Утреня.</b></td><td align="center"><b>Мчч. Евтропия,<br/>Клеоника<br/>Василиска<br/></b>(ок.308)</td></tr>
			   <tr><td align="center"><b>17<br/>марта<br/>пятница</b></td><td><b>08:00 Часы, изобразительны,<br/>Вечерня с Литургией<br/>Преждеосвященных Даров<br/> 16:00 Утреня<br/>(ПАРАСТАС-поминовение усопших)</b></td><td align="center"><b>Блгв. кн. Даниила<br/>Московского<br/></b>(1303)</td></tr>
			   <tr><td align="center"><b>18<br/>марта<br/>суббота</b></td><td><b>08:00   Часы. Божественная Литургия.<br/>Панихида<br/>16:00   Всенощное бдение с выносом<br/>Честнаго Креста Господня</b></td><td align="center"><b>    Поминовение<br/>       усопших.</b></td></tr>
			   <tr><td align="center"><b>19<br/>марта<br/>воскресенье</b></td><td><b>08:00   Исповедь.<br/>08:30 Часы. Божественная<br/>Литургия.<br/>16:00   Пассия</b></td><td align="center"><b>Неделя 3-я<br/>Великого поста,<br/>Крестопоклонная</b></td></tr>

			   <tr><td align="center"><b>20<br/>марта<br/>понедельник</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<b><br/>16:00 Вечерня. Лития</b></td><td align="center"><b>Иконы Божией<br/>Матери, именуемой<br/>«Споручница<br/>грешных»</b></td></tr>
			   <tr><td align="center"><b>21<br/>марта<br/>вторник</b></td><td><b>08:00 Утреня, часы. Изобразительны.<br/>17:00 Вечерня с Литургией<br/>Преждеосвященных Даров</b></td><td align="center"><b>Святых 40<br/>мучеников,<br/>В Севастийском<br/>озере мучившихся.<br/></b> (ок. 320)</td></tr>
			   <tr><td align="center"><b>22<br/>марта<br/>среда</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/>17:00 Вечерня с Литургией<br/>Преждеосвященных Даров</b></td><td align="center"><b>Среда<br/>Крестопоклонной<br/>седмицы</b></td></tr>
			   <tr><td align="center"><b>23<br/>марта<br/>четверг</b></td><td><b>08:00 Утреня, часы, изобразительны.<br/></b>Литургии не положено.<br/><b>16:00 Вечерня. Утреня.</b></td><td align="center"><b>Мч. Кодрата и<br/>дружины его<br/></b>(258)</td></tr>
			   <tr><td align="center"><b>24<br/>марта<br/>пятница</b></td><td><b>08:00 Исповедь, часы, изобразительны,<br/>Вечерня с Литургией<br/>Преждеосвященных Даров<br/>16:00 Утреня<br/>(ПАРАСТАС-поминовение усопших)</b></td><td align="center"><b>Свт. Софрония,<br/>патриарха<br/>Иерусалимского<br/></b>(639)</td></tr>
			   <tr><td align="center"><b>25<br/>марта<br/>суббота</b></td><td><b>08:00   Часы. Божественная Литургия.<br/>Панихида<br/>16:00   Всенощное бдение.<br/><br/><i>08:00 Исповедь. Часы. Божественная<br/>Литургия в больничном храме свт.<br/>ЛУКИ (ВОЙНО-ЯСЕНЕЦКОГО)</i></b></td><td align="center"><b>Поминовение<br/>усопших.</b></td></tr>
			   <tr><td align="center"><b>26<br/>марта<br/>воскресенье</b></td><td><b>08:00   Исповедь.<br/>08:30   Часы. Божественная<br/>Литургия.<br/>16:00   Соборование</b></td><td align="center"><b>Неделя 4-я<br/>Великого поста,<br/>прп. Иоанна<br/>Лествичника</b></td></tr>

			   <tr><td align="center"><b>27<br/>марта<br/>понедельник</b></td><td><b>08:00  Утреня, часы, изобразительны.<br/></b>Литургии не положено.<b><br/>16:00  Вечерня. Лития</b></td><td align="center"><b>Прп. Венедикта<br/>Нурсийского<br/></b>(543)</td></tr>
			   <tr><td align="center"><b>28<br/>марта<br/>вторник</b></td><td><b>08:00  Утреня, часы. Изобразительны.<br/>16:00  Вечерня. Лития</b></td><td align="center"><b>Мч. Агапия и иже с<br/>ним<br/></b>(270-275)</td></tr>
			   <tr><td align="center"><b>29<br/>марта<br/>среда</b></td><td><b>08:00  Утреня, часы, изобразительны.<br/>16:00  Вечерня с Литургией<br/>Преждеосвященных Даров<br/>Утреня с чтением Канона прп. Андрея<br/>Критского (стояние Марии Египетской)</b></td><td align="center"><b>Мч. Савина<br/></b>(287)</td></tr>
			   <tr><td align="center"><b>30<br/>марта<br/>четверг</b></td><td><b>08:00  Часы, изобразительны,<br/>Вечерня с Литургией<br/>Преждеосвященных Даров<br/>16:00 Утреня.</b></td><td align="center"><b>Прп. Алексия,<br/>человека Божия<br/></b>(411)</td></tr>
			   <tr><td align="center"><b>31<br/>марта<br/>пятница</b></td><td><b>08:00  Часы, изобразительны,<br/>Вечерня с Литургией<br/>Преждеосвященных Даров<br/>16:00 Утреня с чтением Акафиста<br/>Пресвятой Богородицы, 1-й час.</b></td><td align="center"><b>Свт. Кирилла,<br/>архиеп.<br/>Иерусалимского<br/></b>(386)</td></tr>
			   <tr><td align="center"><b>1<br/>апреля<br/>суббота</b></td><td><b>08:00   Часы. Божественная Литургия.<br/>16:00   Всенощное бдение</b></td><td align="center"><b>Похвала Пресвятой<br/>Богородицы.<br/>Суббота Акафиста</b></td></tr>
			   <tr><td align="center"><b>2<br/>апреля<br/>воскресенье</b></td><td><b>08:00   Исповедь.<br/>08:30   Часы. Божественная<br/>Литургия.<br/>16:00   Пассия</b></td><td align="center"><b>Неделя 5-я<br/>Великого поста,<br/>Прп. Марии<br/>Египетской.</b></td></tr>
			    
			</tbody>
		</table>

	</Panel>
);

Novomychenik.propTypes = {
	id: PropTypes.string.isRequired,
	go: PropTypes.func.isRequired,
};

export default Novomychenik;
